STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_Power_Peripheral/STM32_WPAN/App/app_ble.c
}

void APP_BLE_Key_Button3_Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    switch(bleAppContext.Device_Connection_Status)
    {
      case APP_BLE_ADV_LP:
      case APP_BLE_ADV_FAST:
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_SET_BROADCAST_MODE);
        break;
      }
      case APP_BLE_ADV_Broadcast_LP:
      case APP_BLE_ADV_Broadcast:
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
        break;
      }
      default:break;
    }
  }
  else
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_PARAM_UPDATE);
  }
 BleStackCB_Process();

}

void Check_Button(void)
{
  uint8_t B1,B2,B3;
    if(PWR_CO_GPIO_Status == PWR_CO_GPIO_OFF)
  {
    return;
  }
  else
  {
   if (PWR_CO_GPIO_Status != PWR_CO_GPIO_OFF)
  {
    MX_GPIO_Init();
  }
  
    B1 = HAL_GPIO_ReadPin(B1_GPIO_Port,B1_Pin);
    B2 = HAL_GPIO_ReadPin(B2_GPIO_Port,B2_Pin);
    B3 = HAL_GPIO_ReadPin(B3_GPIO_Port,B3_Pin);
    
  if ((B1 != 1)&&(bleAppContext.B1_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_1, CFG_SEQ_PRIO_0);
    bleAppContext.B1_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B1 != 0)
  {
    bleAppContext.B1_Switch = 1;
  }  
     if ((B2 != 1)&&(bleAppContext.B2_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_2, CFG_SEQ_PRIO_0);
    bleAppContext.B2_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B2 != 0)
  {
    bleAppContext.B2_Switch = 1;
  }
  
  if ((B3 != 1)&&(bleAppContext.B3_Switch == 1))
  {    
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_3, CFG_SEQ_PRIO_0);
    bleAppContext.B3_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B3 != 0)
  {
    bleAppContext.B3_Switch = 1;
  }
  
  if (PWR_CO_GPIO_Status == PWR_CO_GPIO_TIM_RESET_ON)
  {
    UTIL_TIMER_Stop(&bleAppContext.DISABLE_IOs);
    UTIL_TIMER_StartWithPeriod(&bleAppContext.DISABLE_IOs, Setup_Time);
    PWR_CO_GPIO_Status = PWR_CO_GPIO_ON;
  }
  }
}

static void Send_Data_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_PWR_TX_ID, CFG_SEQ_PRIO_0);
  return;
}

static void GPIO_Off_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_GPIO_OFF_ID, CFG_SEQ_PRIO_0);
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
